app/controllers/articles_controller.rb

def update
  @article = Article.find(params[:id])

  if @article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 2  [["text", "It really is."], ["title", "Rails is awesome!"], ["updated_at", "2014-10-02 16:50:50.473414"]]